package com.example.ukrainetouristic.category;

import android.os.Bundle;
import android.view.Window;
import android.view.WindowManager;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.example.ukrainetouristic.R;

import java.util.ArrayList;
import java.util.List;

public class PrePlaceInfoActivityPamPrurodu extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.recycler_view_item);

        Window w = getWindow();
        w.setFlags(WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS, WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS);

        RecyclerView recyclerView = findViewById(R.id.rv_list);
        List<ItemCategory> mlist = new ArrayList<>();
        mlist.add(new ItemCategory(31,R.drawable.test_cat3_dnister_kan, "Дністровський каньйон", "Верхів'я річки Дністер","Розташований у 4-х областях україни: Івано-Франківської, Тернопільської, Чернівецької та Хмельницької. Загальна довжина близько 250км, що дає йому право називатись одним з найьільших у Європі. Каньйон утворений внаслідок специфічної геологічної будови місцевості, а також тектонічних рухів та процесів водної і вітрової ерозії. Найдавніші пам'ятки природи Дністровського каньйону — скелі девонського геологічного періоду (вік — 350—400 млн років), численні водоспади, широколисті, мішані та соснові ліси, цілющі джерела.\n" +
                "\n" +
                "Окрасою є місцеві заповідники: Урочище Криве, Червона гора, Хмелівська стінка. На лівому березі Дністра з Хмелеви Подільської глибоким яром тече потічок, утворюючи каскад мальовничих водоспадів (висота деяких сягає 6-8 м)."));
        mlist.add(new ItemCategory(32,R.drawable.test_cat3_oleshkivski_pisku, "Олешківські піски", "Олешківський район, Херсонська обл.","Це місце називають найбільшою пустелею Європи, що простягається на 158 км. Площа Олешківських пісків становить 219,9 тис. га. У нинішньому своєму вигляді піски з'явились порівняно недавно. У низинах Дніпра піски існували завжди, але їхнє просування стримувала степова рослинность. У XIX сторіччі сюди почали завозити овець, один лише барон Фальц-Фейн, засновник заповідника Асканія-Нова, володів отарами до мільйона голів, які знищили траву, звільнили піски, а вітрова ерозія дала їм можливість розширюватися. Влітку пісок нагрівається до 70 °C "));
        mlist.add(new ItemCategory(33,R.drawable.test_cat3_korostushiv_kan, "Коростишівський каньйон", "Коростишів, Житомирська обл.","Насправді каньйон штучного походження - це затоплений гранітний кар'єр у якому видобували габбро, лабрадорит та сірий граніт. Виробництво тут почалось у 1890 році і це майже сто років було найбільшим підприємством міста. зараз це одне з улюблених місць місцевих та приїзжіх для купання. Приїзжати потрібно зрання, оскільки пообіді найкращі місця вже будуть зайняті. Пейзаж відкривається неймовірний, чиста вода, високі пагорби кар'єру та ліс. Потрібно бути обережними, адже глибина може сягати 20м. Тут також полюбляють займатись скелелази."));
        mlist.add(new ItemCategory(34,R.drawable.test_cat3_vodospad_djyrin, "Водоспад Джурин", "с.Нирків, Тернопільська обл.","Інша назва Червоноградський водоспад. Назва походить від міста поруч, яке зникло 70 років тому. Водоспад є найвищим рівнинним  водоспадом України та має штучне походження. Існує багато версій походження водоспаду, найвірогіднішою є - наступна: водоспад створений турками під час облоги Червоногородського замку в 1672. Щоб здобути замок, вони перерубали кам'яний кряж між двома сусідніми ділянками річища Джурина, скерувавши повноводну тоді річку, яка до того робила кількакілометрову петлю й огинала пагорб із замком, у нове річище. Так турецькі війська нібито звільнили собі доступ до стін замку. "));
        mlist.add(new ItemCategory(35,R.drawable.test_cat3_pechera_vetreba, "Печера Ветреба", "c.Більче-Золоте, Тернопільська обл.","Гіпсова печера Ветреба належить до найбільших печер у Європі, довжина підземних ходів становить бідьше 9км. Тут Більшу частину року тут тримається температура близько 10 градусів тепла. Печера складається з великих галерей, які поєднані між собою вузькими ходами. У печері живе багато кажанів, особливо взимку. Цікавою вона є тим, що тут знайдено багато археологічних пам'яток яким 6-7 тис. років. Екскурсійний маршрут, прокладений залами та коридорами печери, має довжину 1000 метрів. Для більш підготовлених відвідувачів створений спортивний спелеологічний маршрут. У печері Вертеба діє єдиний в Україні підземний музей трипільської культури."));
        mlist.add(new ItemCategory(35,R.drawable.cat3_uzefin, "Юзефінськй дуб", "c.Глинне, Рівненська обл.","В урочищі Юзефін, що біля села Глинне Рокитнівського району росте 1350-літній дуб.\n" +
                "Ширина дуба –8,4 метра, а висотою дерево сягає 20 метрів.\n" +
                "За місцевими переказами, Юзефінський дуб є свідком походів на древлянські землі князя Ігоря 945 року та княгині Ольги та навіть має відповідне прізвисько «Дуб князя Ігоря». Дерево занесене до Книги рекордів України.\n" +
                " 28 червня 1997 року блискавка влучила у дуба і зрізала найтовщу гілку, розкроїла кору дерева аж до землі. Вчені тоді по тій гілці визначили вік дерева – 1350 років. Тоді у 1997 році місце цієї гілки зацементували, дуб огородили парканом, а стовбур обтягнули металевим обручем.\n" +
                "Поруч в селі Глинне знаходься кам'яні хрести. Ми побачилм їх вмпадклво, ніяких надписів чи табличок не було. Виявилось, що це Глиннівський курганний могильник XI-XIII століття — общинне кладовище часів Київської Русі.\n"));
        mlist.add(new ItemCategory(35,R.drawable.cat3_vasilkiv_karpatu, "Васильківські карпати", "Васильків, Київська обл.","Краєвид як заставка з Windows\n" +
                " Дуже дуже гарне місце поблизу Василькова.\n" +
                " Якщо спуститись в самий низ і глянути догори, то пейзаж і справді нагадує Карпати. Гори, які провалились донизу.\n" +
                "Сама балка і поля довкола  рясно вкриті зеленою травою та ароматними травами-квітами. \n"));
        mlist.add(new ItemCategory(35,R.drawable.cat3_vitachiv, "Витачів", "c.Витачів, Київська обл.","Витачів - одне з місць, яке неодмінно необхідно відвідати і це всього 35км від Києва. Окрім мальовничого краєвиду, це місце з кількатисячною історією. Гора Красуха - найвища точка обухівщини, штучного походження, тобто це насипаний курган, який датують початком 1го тисячоліття. Історики кажуть, що це гуни насипали, але маючи навіть сучасні технології, яку кількість людей треба задіяти, щоб насипати гору висотою 55м.. В лісі нижче ми бачили хвилеподібні схили, явно штучного походження і величезний гранітний камінь наполовину заритий в пісок на крутому схилі.... Для чого вони слугували... Як тут було тисячу років тому... Залишилось багато питань після відвідин. Пізніше Витачів був столицею полянських слов'ян, на горі функціонувало капище, як вважається з потужною енергетикою, потім Витачів став великим містом-портом України-Русі, тут навіть відбувався з' їзд всіх князів в 1100р.\n" +
                "Поряд з селом є частина Змієвих валів, озеро, інші кургани їх ми не побачили.. повернемось сюди ще"));
        Adapter_recycler adapter = new Adapter_recycler(this, mlist);
        recyclerView.setAdapter(adapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
    }
}

