package com.example.ukrainetouristic.category;

import android.os.Bundle;
import android.view.Window;
import android.view.WindowManager;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.example.ukrainetouristic.R;

import java.util.ArrayList;
import java.util.List;

public class PrePlaceInfoActivityZamku extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.recycler_view_item);

        Window w = getWindow();
        w.setFlags(WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS, WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS);

        RecyclerView recyclerView = findViewById(R.id.rv_list);
        List<ItemCategory> mlist = new ArrayList<>();
        mlist.add(new ItemCategory(11, R.drawable.cat1_zbaraj_zamok1, "Зба́разький за́мок", "Збараж, 1626-1631р.", "Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(12, R.drawable.cat1_hotun_zamik1, "Підгоре́цький за́мок", "Підгірці, Львівська обл. 1635-1640р.","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(13, R.drawable.test_cat1_bychach_zamok, "Бучацький замок", "Бучач, Тернопільська обл. 16ст.","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(14, R.drawable.cat1_pidgirzi_zamok1, "Хотинська фортеця", "Хотин, Чернівецька обл. 13-17ст.","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(15, R.drawable.cat1_medjib_zamok1, "Меджибі́зький замок", "Меджибіж, Хмельницька обл. 16ст.","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(16, R.drawable.cat1_kam_pod_zamok1, "Кам'яне́ць-Поді́льська форте́ця", "Кам'яне́ць-Поді́льськ, Хмельницька обл. 16ст.","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(17, R.drawable.mp5, "Palace", "fghjklcvbnm,rtyuiop","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(18, R.drawable.mp5, "Palace", "fghjklcvbnm,rtyuiop","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(19, R.drawable.mp5, "Palace", "fghjklcvbnm,rtyuiop","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        mlist.add(new ItemCategory(20, R.drawable.mp5, "Palace", "fghjklcvbnm,rtyuiop","Білосніжна усмішка,без сумніву, – найкраща прикраса для кожної людини. Здорові та білі зуби нададуть впевненості. Електрична зубная щітка на акумуляторі HGC Turbo буде чудовим помічником у догляді за ротовою порожниною. Ергономічна ручка з гумовими вставками дозволяє зручно тримати щітку, не напружуючи руку. Щітку буде зручно використовувати як дорослим так і дітям. Товар має європейські сертифікати CE та RoHS."));
        Adapter_recycler adapter = new Adapter_recycler(this, mlist);
        recyclerView.setAdapter(adapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));

    }
}