package com.example.ukrainetouristic.category;

import android.os.Bundle;
import android.view.Window;
import android.view.WindowManager;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.example.ukrainetouristic.R;

import java.util.ArrayList;
import java.util.List;

public class PrePlaceInfoActivityZikaviMiszia extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.recycler_view_item);

        Window w = getWindow();
        w.setFlags(WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS, WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS);

        RecyclerView recyclerView = findViewById(R.id.rv_list);
        List<ItemCategory> mlist = new ArrayList<>();
        mlist.add(new ItemCategory(41, R.drawable.cat4_zmievi_valu1, "Змієві вали", "Васильків, Київська обл.", "Це залишки оборонних споруд. Загальна довжина 2000км. Ісорики стверджують що це укріплення часів Київської Русі, але важко уявити скільки зусиль та людей потрібно для зведення такої кількості оборонних споруд, при тогочасному розвитку техніки. Також їх оборонне значення піддається сумніву, так як щоб по всій довжині розмістити війська для оборони - військо має налічувати мільйон воїнів, при тому що все населення Київської Русі в 10 ст. було близько 5млн. осіб. Вали потребують збереження та подальшого вивчення, зараз можна зустріти лише поодинокі їх частини, більша частина була знищена або розорана. "));
        mlist.add(new ItemCategory(42, R.drawable.cat4_zentr_europa1, "Географічний центр Європи", "с.Ділове, Закарпатська обл. ", "У 1885–1887 роках географи з Імператорсько-Королівського військово-географічного інституту у Відні, проводили дослідження в Закарпатській області сучасної України та встановили, що Географічний центр Європи знаходиться поряд з с. Ділове, де й встановили кам'яний знак з координатами. Варто згадати, що на цей статус претендують інші країни з певними обумовленнями. "));
        mlist.add(new ItemCategory(43, R.drawable.cat4_zalischiki, "Панорама на Заліщики", "Заліщики, Тернопільська обл. ", "Над чарівним Дністром, потапає в садах, повна краси і чару місцевість, колись повітовий центр – Заліщики. Заліщики – невелике містечко, що лежать у мальовничій долині на лівому березі Дністра немов би на півострові. Дністер танцює навколо цього міста на  Тернопільщині такі викрутаси, що, здається, от-от  накриє повністю місто в своїх глибоких обіймах. Заліщики від обіймів не пручаються, адже саме завдяки височенним берегам Дністра це подільське місто може похвалитися середземноморським кліматом. Про те, що місто-півострів було колись відомим європейським курортом, знають навіть далеко не всі мешканці району. Саме це місце називалося на початку минулого століття «Польською Рiв’єрою» і було розвиненим кліматологічним курортом, до якого ходив прямий швидкісний поїзд аж з Варшави. Береги Дністра були забудовані віллами та пансіонатами. Найкраще панорама відкривається з боку села Хрещатик, що уже в Чернівецькій області."));
        mlist.add(new ItemCategory(44, R.drawable.cat4_zalischiki, "Клеваньський тунель кохання", "Клевань, Рівненська обл. ", "Тунель Кохання розташований на відрізку близько 4 км діючої залізничної дороги. Тунель є місцем паломництва туристів та закоханих. Є декілька любовних повір'їв, які пов'язані з цією прекрасною місцевістю. Одна з них - закохані мають поцілуватися у той час, коли тунелем проїде потяг та неодмінно загадати бажання одне на двох."));
        mlist.add(new ItemCategory(45, R.drawable.cat4_nosivka, "Носівська станція", "Носівка, Чернігівська обл. 1911р.", "Носівська селекційна станція, с. Дослідне, - будівля без статусу пам'ятки архітектури, рідко в яких путівниках можна її зустріти, а дарма. Це одна з найстаріших наукових установ України. Спроектував будинок Євген Сердюк - один із фундаторів українського модерну.\n" +
                "Звели споруду в 1911-1913 рр. Важко повірити, що зараз тут квартирний будинок. На території є два дерев'яних гамазеї (сховища зерна) справжні музейні експонати."));
        mlist.add(new ItemCategory(46, R.drawable.cat4_plebanivskii_viaduk, "Плебанівський віадук", "с. Плебанівка, Тернопільська обл. 1896р.", "Унікальний міст – Плебанівський віадук 1896 року– розташований на території Тернопільській області, неподалік від села Плебанівки. Він не входив до нашого списку подорожі, побачили ми його випадково, прямуючи до Теребовлі.\n" +
                "Плебанівський віадук потрапив до рейтингу найкращих мостів України. Цей красень досі працює, помилуватися його міццю і величчю приїжджають мандрівники з різних куточків України.\n" +
                "Міст з Гаррі Поттера, перше, що промайнуло в голові.  Величезний, 30-ти метровий, наче кам'яний змій, він простягнувся через урвище. Захоплювало подих, коли ми з @vvgrom стояли посередині." +
                "На території Західної України збереглося шість віадуків із залізничною колією. Три з них на Тернопільщині. \n" +
                "Цікавий факт: кілька років тому відбулось спецпогашення поштової марки, на якій зображено міст у селі Плебанівці Тернопільської області. Ця марка стала відомою та бажаною всім колекціонерам."));
        mlist.add(new ItemCategory(47, R.drawable.cat4_nosivka, "Санно-бобслейна траса", "Кременець, Тернопільська обл. 1970-ті", "Санна траса — санна траса в Кременці. Це єдина в Україні деревяна санна траса.\n" +
                "Площа 6 га, довжина траси: 1157 м, перепад висот 94 м та 15 поворотів.  Збудована ще в 1970 ті роки свого часу вона була потужною олімпійською базою Радянського союзу, сьогодні ж вражає хіба своєю занедбаністю. З 1157-ми метрів, зараз діючі від сили метрів 600.. Зараз тут тренуються учні Кременецької школи. Сани подарували меценати , одна пара-1500€"));
        Adapter_recycler adapter = new Adapter_recycler(this, mlist);
        recyclerView.setAdapter(adapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
    }
}