package com.example.ukrainetouristic.category;

import android.os.Bundle;
import android.view.Window;
import android.view.WindowManager;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.example.ukrainetouristic.R;

import java.util.ArrayList;
import java.util.List;

public class PrePlaceInfoActivityReligiini extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.recycler_view_item);

        Window w = getWindow();
        w.setFlags(WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS, WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS);

        RecyclerView recyclerView = findViewById(R.id.rv_list);
        List<ItemCategory> mlist = new ArrayList<>();
        mlist.add(new ItemCategory(51,R.drawable.cat5_pochaiv1, "Почаївська Успенська лавра","Почаїв, Тернопільська обл. 1771-1791р.","Почаївська Успенська лавра - православний чоловічий монастир. Це найбільша православна святиня Волині, друга, після Києво-Печерської лаври, України. Монастир перебуває в оренді УПЦ московського патріархату.   "));
        mlist.add(new ItemCategory(52,R.drawable.cat5_kostel_stara_kotelna1, "Костел Антонія Падуанського","с.Стара Котельня, Житомирська обл.","Стара Котельня належить до числа найдавніших населених пунктів України.\n" +
                "Цікавою пам'яткою архітектури є побудований у стилі барокко костел св. Антонія Падуанського 1786 р.\n" +
                " Зовні не відреставрований, і хто зна чи колись буде...але в середині нині відремонтована, діюча церква. \n" +
                "Сам костел знаходиться на території старовинного городища, яке возвишається над р. Гуйвою і з якого відкривається чудовий краєвид на долину річки і навколишню місцевість. Також саме селище вважається одним з найстаріших в Україні, наквколо було знайдено багато курганів.\n"));
        mlist.add(new ItemCategory(53,R.drawable.cat5_kremenec_kolegium1, "Єзуїтський колегіум","Кременець, Тернопільська обл. 1720р.","Єзуїтський колегіум у Кременці одна з найкрасивіших споруд міста. Її чудово видно з оглядового майданчику замку. Єзуїти з’явилися у Кременці у 1702 році. Це була невелика група монах, що прибули в містечко за запрошенням кременецького старости Януша-Антонія Вишневецького.\n" +
                "У 1750-му році було відкрито Кременецький колегіум.\n" +
                " 1753 р. закінчили будівництво найефектнішої споруди комплексу – костьолу Ігнатія Лойоли та Станіслава Костки. Колегіум представляв собою ціле навчально-релігійне містечко, яке втім, проіснувало недовго до 1773. Від того часу монастир підпорядковувався Комісії народної освіти. Трохи пізніше тут відкрили школу, а у 1803 році тут відкрилася Волинська гімназія, яка пізніше трансформувалася легендарний, ліцей, із величезною бібліотекою та ботанічним садом.\n" +
                "Кременецький ліцей являвся найбільшим світським закладом освіти в межах Правобережжя України. У 1833 році ліцей перевели до Києва – на його базі було створено Університет святого Володимира (нині імені Шевченка),що саідчить про високий рівень тодішньої освіти. Нині в колишньому костьолі розміщується храм Преображення Господнього УПЦ КП. В будівлях колегіуму різні установи, в тому числі школа."));
        mlist.add(new ItemCategory(54,R.drawable.cat5_klara1, "Костел Святої Клари","Городківка, Житомирська обл. 1910-13р.","До забутого, без перебільшення, села веде вузька дорога, вимощена бруківкою, а протягом всього часу дороги сюди з обласного центру зустрілось пару машин. Глибину ям, які попадались по дорозі, краще не згадувати. Але ми дуже хотіли побувати біля Костелу. Мені він видався казковим.\n" +
                "Костел св. Клари в Халаїмгородку (так раніше називалася Городківка) побудований у еклектичному стилі, в якому поєдналися елементи неоготики. Храм зведено у 1913, оточений ставом майже з усіх боків і нагадує більше замкову фортецю. \n" +
                "Костел діючий, в чудовому стані. В центрі села збереглася кордигардія маєтку  Івановського, а на околиці - залишки водяного млина.\n"));
        mlist.add(new ItemCategory(55,R.drawable.cat5_pidgirzi_kostel, "Костел","Підгірці, Львівська обл. 1752-66р.","Церква Блаженного Миколая Чарнецького та новомучеників УГКЦ. Алея з туй від Підгорецького замку веде до не менш цікавого Костелу Воздвиження та св. Йосипа 1766 року, що планувався господарем замку як власна усипальня.\n" +
                "Костел діючий, вражає своєю величчю та збереженими скульптурами.Неподалік костелу стоять дві фігури з XVIII столітя: богоматір та св. Йосип.\n" +
                " В часи Першої світової костел майже не постраждав. На даху можемо спостерігати фігури святих, з самого початку їх було 8, у 1944 році купол храму, північно-східну стіну та одну зі статуй було пошкоджено снайпером.. В 1945 році святиню закрили. Реставрація споруди відбувалася в 1976-1979 роках.\n"));
        mlist.add(new ItemCategory(56,R.drawable.cat5_bosi_karmelit_berd1, "Монастир Кармелітів Босих","Бердичів, Житомирська обл. 1634-42р..","Фортеця-монастир босих кармелітів  – головна і найвідоміша пам’ятка Бердичева. В 1630 році перший власник Тишкевич віддає свій замок католицькому ордену босих кармелітів для розташування кляштору. У в 1634 році кармеліти заклали підземний Маріїнський костел, побудували торгівельні склади, крамниці та інші господарські будівлі, поширили мури фортеці. Завдяки величній бароковій архітектурі у поєднанні з оборонними спорудами та мальовничим місцем розташування на пагорбі над розливом річки Гнилоп’ять комплекс замку, перетвореного на монастир не поступається іншим фортецям за величчю. Широка ріка омиває його з південної та західної сторін.. Ансамбль монастирських будівель оточується оборонними мурами з бійницями, наріжними вежами та укріпленнями, збудованими під керівництвом архітектора Яна де Вітте в середині XVIII сторіччя. З 1739 по 1754 рік кармеліти будують новий великий надземний костьол над старим підземним. На його будівництво коштів не шкодували. І справді костел чарує своєю величчю, могутністю  та пишністю, що притаманна стилю барокко."));

        Adapter_recycler adapter = new Adapter_recycler(this, mlist);
        recyclerView.setAdapter(adapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
    }
}